In [87]:
#  모듈 불러오기
import numpy as np
import pandas as pd

시리즈의 멀티 인덱스

In [1]:
# 문제1

In [17]:
# 매출 데이터를 담은 시리즈 생성
# 데이터 : 매출
# 인덱스 : (멀티) 지역-지점
# 1단계는 지역
# 2단계는 지점

s = pd.Series([120,100,90,80],
              index= [['서울', '서울', '부산','부산'],
                      ['강남점','강북점','해운대점','서면점']]
             )
s
s.index

MultiIndex([('서울',  '강남점'),
            ('서울',  '강북점'),
            ('부산', '해운대점'),
            ('부산',  '서면점')],
           )

In [9]:
# 시리즈에서 값 꺼내기
# 서울 전체 매출 조회
s['서울']
# 부산 해운대점 매출 조회
s.loc[ ('부산','해운대점') ]

np.int64(90)

In [ ]:
# 문제2

In [20]:
# 쇼핑몰의 판매량 데이터
# • 인덱스 : 카테고리-상품명
# • 값: 판매량
# 데이터의 개수와 인덱스의 개수가 맞지 않으면, 에러남
s = pd.Series([300,250,500,400],
              index = [['전자제품','전자제품','식품','식품'],
                       ['노트북',',휴대폰','라면','과자']]
             )
s
s.index

MultiIndex([('전자제품',  '노트북'),
            ('전자제품', ',휴대폰'),
            (  '식품',   '라면'),
            (  '식품',   '과자')],
           )

In [21]:
# 전자제품 카테고리 전체 판매량을 조회하세요
s['전자제품']
# 식품 카테고리의 라면 판매량을 조회하세요
s.loc['식품','라면']

np.int64(500)

In [ ]:
# 문제3

In [19]:
# 도서관의 대출 건수
# • 인덱스: 학년-과목
# • 값: 대출 건수

s = pd.Series([40,35,50,45],
              index=[['1학년','1학년','2학년','2학년'],
                     ['국어', '수학', '국어', '수학']]
             )
s
s.index

MultiIndex([('1학년', '국어'),
            ('1학년', '수학'),
            ('2학년', '국어'),
            ('2학년', '수학')],
           )

In [16]:
# 1학년 전체 대출 건수를 조회하세요
s['1학년']
# 2학년 수학 과목의 대출 건수를 조회하세요
s.loc['2학년','수학']

np.int64(45)

데이터 프레임의 멀티 인덱스

In [ ]:
# 문제1

In [25]:
# 도서관 대출 건수 데이터프레임 생성
# 행: 도서관-월
# 열: 책의 카테고리
# 데이터: 대출 건수
df = pd.DataFrame( [ [120,45], [95,60], [150,70], [110,55] ],
                 index=[ ['중앙도서관','중앙도서관','시립도서관','시립도서관'],
                         ['1월','2월','1월','2월'] ],
                 columns=['소설','과학']
                 )
df

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [28]:
# 중앙도서관 전체 대출 건수를 조회하세요
print(df.index)
print(df.columns)
df.loc['중앙도서관']
# 시립도서관 2월의 과학 대출 건수를 조회하세요
df.loc[('시립도서관', '2월'),'과학']

MultiIndex([('중앙도서관', '1월'),
            ('중앙도서관', '2월'),
            ('시립도서관', '1월'),
            ('시립도서관', '2월')],
           )
Index(['소설', '과학'], dtype='object')

np.int64(55)

In [ ]:
# 문제2

In [37]:
# 자동차 판매량 데이터프레임 생성
# 행 인덱스: 연도-차종
# 열: 1분기, 2분기
# 값: 판매 대수
df = pd.DataFrame( [ [320,280],[210,230],[400,390],[180,200]],
                   index=[ ['2022년','2022년','2023년','2023년'],
                          ['SUV','세단','SUV','세단'] ],
                   columns=['1분기','2분기']
                 )
df

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [36]:
print(df.index)
print(df.columns)
# 2022년 전체 판매량을 조회하세요
df.loc['2022년']

# 2023년 세단의 2분기 판매량을 조회하세요
df.loc[('2023년',  '세단'), '2분기']

MultiIndex([('2022년', 'SUV'),
            ('2022년',  '세단'),
            ('2023년', 'SUV'),
            ('2023년',  '세단')],
           )
Index(['1분기', '2분기'], dtype='object')

np.int64(200)

In [ ]:
# 문제3

In [44]:
# 호텔 예약 건수 데이터프레임 생성
# • 행 인덱스: 지점-월
# • 열: 싱글룸, 더블룸
# • 값: 예약 건수

df = pd.DataFrame([[45,30],[50,35],[60,40],[55,38]],
                 index=[['서울지점','서울지점','부산지점','부산지점'],
                       ['7월','8월','7월','8월']],
                 columns=['싱글룸','더블룸'])
df

         싱글룸  더블룸
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [46]:
print(df.index)
print(df.columns)
# 서울지점 전체 예약 건수를 조회하세요
df.loc['서울지점']
# 부산지점 8월의 더블룸 예약 건수를 조회하세요
df.loc[('부산지점', '8월'), '더블룸']

MultiIndex([('서울지점', '7월'),
            ('서울지점', '8월'),
            ('부산지점', '7월'),
            ('부산지점', '8월')],
           )
Index(['싱글룸', '더블룸'], dtype='object')

np.int64(38)

In [ ]:
# 문제4

In [39]:
# 쇼핑몰 주문 건수 데이터프레임 생성
# • 행 인덱스: 카테고리-상품
# • 열: 1월, 2월
# • 값: 주문 건수

df = pd.DataFrame([[120,140],[80,95],[200,220],[150,160]],
                 index=[['가전','가전','식품','식품'],
                        ['노트북','청소기','라면','과자']],
                 columns=['1월','2월'])
df

         1월   2월
가전 노트북  120  140
   청소기   80   95
식품 라면   200  220
   과자   150  160

In [42]:
print(df.index)
print(df.columns)
# 가전 카테고리 전체 주문 건수를 조회하세요
df.loc['가전']
# 식품 카테고리 라면의 2월 주문 건수를 조회하세요
df.loc[('식품',  '라면'), '2월']

MultiIndex([('가전', '노트북'),
            ('가전', '청소기'),
            ('식품',  '라면'),
            ('식품',  '과자')],
           )
Index(['1월', '2월'], dtype='object')

np.int64(220)

데이터 합치기 (merge)

In [48]:
# 문제1

In [55]:
# 고객 데이터를 담은 DataFrame와 주문 데이터를 담은 DataFrame를 만들기
df1 = pd.DataFrame({'고객ID':[101,102,103],'이름':['철수','영희','민수']})
df2 = pd.DataFrame({'고객ID':[101,104,102],'상품':['노트북','청소기','책']})

In [58]:
# 고객ID 기준으로 합치세요
pd.merge(df1, df2, on='고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [ ]:
# 문제2

In [61]:
# 직원 데이터를 담은 DataFrame와 부서 데이터를 담은 DataFrame를 만들기
df1 = pd.DataFrame({'사번':[1,2,3],'이름':['홍길동','임꺽정','이몽룡']})
df2 = pd.DataFrame({'사번':[1,3],'부서':['영업','개발']})

   사번  부서
0   1  영업
1   3  개발

In [62]:
# 사번 기준으로 합치세요
pd.merge(df1,df2,on='사번',how='left')

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

In [ ]:
# 문제3

In [63]:
# 상품 데이터를 담은 DataFrame와 재고 데이터를 담은 DataFrame를 만들기
df1 = pd.DataFrame({'상품코드':['A1','A2','A3'],'상품명':['노트북','청소기','책상']})
df2 = pd.DataFrame({'상품코드':['A2','A3','A4'],'재고':[5,8,10]})

In [64]:
# 상품코드 기준으로 합치세요
pd.merge(df1,df2,on='상품코드',how='right')

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

In [ ]:
# 문제4

In [65]:
# 학생 데이터를 담은 DataFrame와 동아리 데이터를 담은 DataFrame를 만들기
df1 = pd.DataFrame({'학번':[1,2,3],'이름':['지훈','서연','민지']})
df2 = pd.DataFrame({'학번':[2,4],'동아리':['축구부','합창단']})

In [66]:
# 학번 기준으로 합치세요
pd.merge(df1,df2,on='학번',how='outer')

   학번   이름  동아리
0   1   지훈  NaN
1   2   서연  축구부
2   3   민지  NaN
3   4  NaN  합창단

데이터 합치기 (concat)

In [ ]:
# 문제1

In [74]:
# 사원 데이터를 담은 DataFrame와 부서 데이터를 담은 DataFrame를 만들기 
df1 = pd.DataFrame({'사번':[1,2],'이름':['홍길동','임꺽정']})
df2 = pd.DataFrame({'부서':['영업','개발']})

In [76]:
# 하나로 합치세요
pd.concat( [df1, df2], axis=1 )

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [ ]:
# 문제2

In [77]:
# 세 개의 매출 데이터 DataFrame를 만들기 
df1 = pd.DataFrame({'매출':[100,200]})
df2 = pd.DataFrame({'매출':[150,250]})
df3 = pd.DataFrame({'매출':[300,400]})

In [79]:
# 하나로 합치세요
pd.concat( [df1, df2, df3] , ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [ ]:
# 문제3

In [80]:
# 두 개의 학생 점수 데이터를 담은 DataFrame를 만들기
df1 = pd.DataFrame({'이름':['철수','영희'], '국어':[85,90]})
df2 = pd.DataFrame({'이름':['민수','지연'], '수학':[78,92]})

In [82]:
# 하나로 합치세요
pd.concat([df1,df2,],axis=1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92

데이터 재구성 (pivot)

In [ ]:
# 문제1

In [98]:
# 쇼핑몰 판매 데이터를 담은 DataFrame를 만들기 
df = pd.DataFrame({
    '카테고리': ['식품', '식품', '가전', '가전'],
    '월': ['1월', '2월', '1월', '2월'],
    '매출': [200, 250, 500, 550]
})

In [99]:
# pivot을 이용해 카테고리별 월 매출을 출력하세요
result = df.pivot(index='카테고리', columns='월', values='매출')
print(result)

월      1월   2월
카테고리
가전    500  550
식품    200  250

In [ ]:
# 문제2

In [94]:
# 도서관 대출 데이터를 담은 DataFrame를 만들기
df = pd.DataFrame({'도서관':['중앙','중앙','시립','시립'],
                   '장르':['소설','과학','소설','과학'],
                   '대출건수':[120,45,95,60]})

In [95]:
# pivot을 이용해 도서관별 장르 대출 건수를 출력하세요
df.pivot(index='도서관',columns='장르',values='대출건수')

장르   과학   소설
도서관
시립   60   95
중앙   45  120

In [ ]:
# 문제3

In [100]:
# 호텔 예약 데이터를 담은 DataFrame를 만들기
df = pd.DataFrame({'지점':['서울','서울','부산','부산'],
                  '객실유형':['싱글룸','더블룸','싱글룸','더블룸'],
                  '예약건수':[45,30,50,35]})

In [101]:
# pivot을 이용해 지점별 객실 유형 예약 건수를 출력하세요
df.pivot(index='지점',columns='객실유형',values='예약건수')

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45